In [37]:
import math
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [68]:
tags = ['java', 'javascript', 'mysql']

groups = ['Group-1', 'Group-2', 'Group-3']

users = ['alice', 'john', 'kevin']

group_tags = [
    [1, 0, 0],
    [1, 1, 1],
    [1, 0, 0],
]

user_tags = [
    [1, 0, 1],
    [1, 1, 1],
    [0, 0, 0],
]

In [69]:
# group_tags_frame
pd.DataFrame(group_tags, columns=groups, index=tags)

            Group-1  Group-2  Group-3
java              1        0        0
javascript        1        1        1
mysql             1        0        0

In [70]:
# user_tags_frame
pd.DataFrame(user_tags, columns=tags, index=users)

       java  javascript  mysql
alice     1           0      1
john      1           1      1
kevin     0           0      0

In [71]:
# dot product
pd.DataFrame(np.dot(user_tags, group_tags) / len(tags), columns=groups, index=users)

# This outcome says how many of a users tags are in a given group
# Dividing the dot product by the total amount of tags/features gives a value between 0 and 1
# Given 1 all user tags are listed in the group and given 0 none of the users tags are in the group

        Group-1   Group-2   Group-3
alice  0.666667  0.000000  0.000000
john   1.000000  0.333333  0.333333
kevin  0.000000  0.000000  0.000000